package com.javarush.tasts.level3.lesson12.task2;

public class Solution {

    /*
     Вывести на экран десять раз надпись «Я не хочу изучать Java, я хочу большую зарплату»
     */

    public static void main(String[] args){

        for (int i = 0; i < 10; i++) {
            System.out.println("Я не хочу изучать Java, я хочу большую зарплату");
        }
    }
}
