package com.javarush.tasts.level3.lesson4.task1;

public class Solution {

    //Вывести на экран дату своего рождения в виде: MAY 1 2012

    public static void main(String[] args) {

        System.out.println("MAY 1 2012");
    }
}
