package com.javarush.tasts.level3.lesson12.task1;

public class Solution {

    /*
     Вывести на экран надпись «Жить хорошо, а хорошо жить еще лучше»
     */

    public static void main(String[] args) {

        System.out.println("Жить хорошо, а хорошо жить еще лучше");
    }
}
